; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj6 obj15 - airport
	obj1 obj3 - city
	obj4 obj11 obj12 obj13 - package
	obj5 obj9 obj10 obj14 - location
	obj7 obj8 - truck
	obj16 - airplane
)

(:init
	(at obj7 obj2)
	(in-city obj9 obj1)
	(in-city obj15 obj1)
	(in-city obj2 obj3)
	(in-city obj6 obj1)
	(in-city obj10 obj1)
	(in-city obj14 obj3)
	(in-city obj0 obj1)
	(at obj13 obj0)
	(at obj8 obj5)
	(in-city obj5 obj1)
	(at obj4 obj0)
	(at obj11 obj5)
	(at obj12 obj9)
	(at obj16 obj15)
)

(:goal (and
	(at obj4 obj9)
	(at obj13 obj15)
	(at obj11 obj9)
	(at obj12 obj6)
))
)

; plan
1. (load obj8 obj11 obj5)
   deleted: (at obj11 obj5)
   added: (in obj11 obj8)
   goals met: 0 of 4
2. (drive obj8 obj5 obj0)
   deleted: (at obj8 obj5)
   added: (at obj8 obj0)
   goals met: 0 of 4
3. (load obj8 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj8)
   goals met: 0 of 4
4. (drive obj8 obj0 obj6)
   deleted: (at obj8 obj0)
   added: (at obj8 obj6)
   goals met: 0 of 4
5. (drive obj8 obj6 obj9)
   deleted: (at obj8 obj6)
   added: (at obj8 obj9)
   goals met: 0 of 4
6. (unload obj8 obj4 obj9)
   deleted: (in obj4 obj8)
   added: (at obj4 obj9)
   goals met: 1 of 4
7. (load obj8 obj12 obj9)
   deleted: (at obj12 obj9)
   added: (in obj12 obj8)
   goals met: 1 of 4
8. (unload obj8 obj11 obj9)
   deleted: (in obj11 obj8)
   added: (at obj11 obj9)
   goals met: 2 of 4
9. (drive obj8 obj9 obj6)
   deleted: (at obj8 obj9)
   added: (at obj8 obj6)
   goals met: 2 of 4
10. (unload obj8 obj12 obj6)
   deleted: (in obj12 obj8)
   added: (at obj12 obj6)
   goals met: 3 of 4
11. (fly obj16 obj15 obj0)
   deleted: (at obj16 obj15)
   added: (at obj16 obj0)
   goals met: 3 of 4
12. (load obj16 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj16)
   goals met: 3 of 4
13. (fly obj16 obj0 obj15)
   deleted: (at obj16 obj0)
   added: (at obj16 obj15)
   goals met: 3 of 4
14. (unload obj16 obj13 obj15)
   deleted: (in obj13 obj16)
   added: (at obj13 obj15)
   goals met: 4 of 4
